; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v8 - type_2 ?v5 - type_1)
 	      (pred_1 ?v4 - object ?v5 - type_1)
	      (pred_4 ?v8 - type_2 ?v2 - type_3)
	      (pred_3 ?v8 - type_2 ?v4 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v8 - type_2 ?v7 ?v6 - type_1)
       :precondition (and  (pred_2 ?v8 ?v7))
       :effect (and  (pred_2 ?v8 ?v6)
		     (not (pred_2 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_2 ?v1 - object ?v3 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v3) (pred_2 ?v8 ?v3) (pred_4 ?v8 ?v2))
       :effect (and (pred_3 ?v8 ?v1 ?v2)
		    (not (pred_1 ?v1 ?v3)) 
		    (not (pred_4 ?v8 ?v2))))

   (:action op_3
       :parameters (?v8 - type_2 ?v1 - object ?v3 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v8 ?v1 ?v2) (pred_2 ?v8 ?v3))
       :effect (and (pred_1 ?v1 ?v3)
		    (pred_4 ?v8 ?v2)
		    (not (pred_3 ?v8 ?v1 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_03 - type_2
obj_02 obj_04 obj_05 obj_07 - type_3
obj_12 obj_08 obj_06 obj_11 - type_1
obj_13 obj_10 obj_01 - object)
(:init
(pred_2 obj_09 obj_12)
(pred_4 obj_09 obj_02)
(pred_4 obj_09 obj_04)
(pred_2 obj_03 obj_12)
(pred_4 obj_03 obj_05)
(pred_4 obj_03 obj_07)
(pred_1 obj_13 obj_06)
(pred_1 obj_10 obj_11)
(pred_1 obj_01 obj_08)
)
(:goal
(and
(pred_1 obj_13 obj_08)
(pred_1 obj_10 obj_06)
(pred_1 obj_01 obj_06)
)
)

(:constraints
  (always (not (pred_2 obj_09 obj_06)))
)
)

; plan
1. (op_1 obj_09 obj_12 obj_08)
   deleted: (pred_2 obj_09 obj_12)
   added: (pred_2 obj_09 obj_08)
   goals met: 0 of 3
2. (op_1 obj_03 obj_12 obj_11)
   deleted: (pred_2 obj_03 obj_12)
   added: (pred_2 obj_03 obj_11)
   goals met: 0 of 3
3. (op_2 obj_03 obj_10 obj_11 obj_07)
   deleted: (pred_1 obj_10 obj_11) (pred_4 obj_03 obj_07)
   added: (pred_3 obj_03 obj_10 obj_07)
   goals met: 0 of 3
4. (op_2 obj_09 obj_01 obj_08 obj_04)
   deleted: (pred_1 obj_01 obj_08) (pred_4 obj_09 obj_04)
   added: (pred_3 obj_09 obj_01 obj_04)
   goals met: 0 of 3
5. (op_1 obj_03 obj_11 obj_06)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_06)
   goals met: 0 of 3
6. (op_3 obj_09 obj_01 obj_08 obj_04)
   deleted: (pred_3 obj_09 obj_01 obj_04)
   added: (pred_1 obj_01 obj_08) (pred_4 obj_09 obj_04)
   goals met: 0 of 3
7. (op_3 obj_03 obj_10 obj_06 obj_07)
   deleted: (pred_3 obj_03 obj_10 obj_07)
   added: (pred_1 obj_10 obj_06) (pred_4 obj_03 obj_07)
   goals met: 1 of 3
8. (op_2 obj_03 obj_13 obj_06 obj_07)
   deleted: (pred_1 obj_13 obj_06) (pred_4 obj_03 obj_07)
   added: (pred_3 obj_03 obj_13 obj_07)
   goals met: 1 of 3
9. (op_1 obj_03 obj_06 obj_08)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_08)
   goals met: 1 of 3
10. (op_3 obj_03 obj_13 obj_08 obj_07)
   deleted: (pred_3 obj_03 obj_13 obj_07)
   added: (pred_1 obj_13 obj_08) (pred_4 obj_03 obj_07)
   goals met: 2 of 3
11. (op_2 obj_03 obj_01 obj_08 obj_07)
   deleted: (pred_1 obj_01 obj_08) (pred_4 obj_03 obj_07)
   added: (pred_3 obj_03 obj_01 obj_07)
   goals met: 2 of 3
12. (op_1 obj_03 obj_08 obj_06)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_06)
   goals met: 2 of 3
13. (op_3 obj_03 obj_01 obj_06 obj_07)
   deleted: (pred_3 obj_03 obj_01 obj_07)
   added: (pred_1 obj_01 obj_06) (pred_4 obj_03 obj_07)
   goals met: 3 of 3
